// Напишите программу, которая будет выдавать название дня недели по заданному номеру. 
// 3 -> Среда, 5 -> Пятница.

switch (выражение)
{
    case значение1:
       код выполняемый, если выражение имеет значение1
       break;
    case зачение2:
       код выполняемый, если выражение имеет значение2
       break;
    //...........
    case значениеN:
       код выполняемый, если выражение имеет значениеN
       break;
    default:
       код выполняемый, если выражение не имеет ни одно из вышеуказанных значений
       break;         
}
